{
    "title": "Privacy Policy",
    "lastUpdated": "October 13th, 2025",
    "intro": "Welcome to AImpact.dev (\"AImpact,\" \"we,\" \"our,\" or \"us\"). This Privacy Policy explains how we collect, use, and protect your information when you access or use our platform, including all related AI systems, blockchain integrations, and associated applications (collectively, the \"Service\").",
    "sections": [
      {
        "content": [
          {
          "type": "paragraph",
          "value": "Until the official legal entity for AImpact is established, all payments, billing, and operational activities are temporarily handled by Sole Proprietor Oleksii Pitenko (FOP Pitenko Oleksii Yevheniyovych), registered in Ukraine, acting on behalf of the AImpact project."
          }
        ]
      },
      {
        "heading": "1. Information We Collect",
        "content": [
          {
            "type": "paragraph",
            "value": "We may collect the following categories of information:"
          },
          {
            "type": "list",
            "value": [
              "Account Information: wallet address, X (Twitter) handle, Telegram handle, and authentication credentials when you create an account.",
              "Usage Data: interactions with the Service, including logs, device information, browser type, and IP address.",
              "AI and Project Data: text, code, or other content you input or generate through the Service.",
              "Blockchain Data: wallet addresses, public keys, and on-chain transactions related to your use of AImpact features.",
              "Third-Party Data: data received from integrated platforms such as Twitter, AWS, Akash, or n8n (subject to their policies)."
            ]
          }
        ]
      },
      {
        "heading": "2. How We Use Your Information",
        "content": [
          {
            "type": "paragraph",
            "value": "We use the collected data to:"
          },
          {
            "type": "list",
            "value": [
              "Provide, maintain, and improve the Service;",
              "Facilitate AI-generated outputs, project deployment, and integrations;",
              "Communicate with you about updates, support, and security;",
              "Analyze performance and usage trends to enhance the user experience;",
              "Prevent fraud, abuse, and unauthorized access;",
              "Comply with legal and regulatory obligations."
            ]
          }
        ]
      },
      {
        "heading": "3. Legal Basis for Processing (EEA/UK Users)",
        "content": [
          {
            "type": "paragraph",
            "value": "For users in the European Economic Area (EEA) or United Kingdom (UK), we process personal data based on:"
          },
          {
            "type": "list",
            "value": [
              "Your consent (e.g., newsletter or marketing opt-ins);",
              "Performance of a contract (providing the AImpact Service);",
              "Legitimate interests (improving products, security, fraud prevention);",
              "Legal compliance obligations."
            ]
          }
        ]
      },
      {
        "heading": "4. How We Share Information",
        "content": [
          {
            "type": "paragraph",
            "value": "We may share your information with:"
          },
          {
            "type": "list",
            "value": [
              "Service Providers: hosting, analytics, payment, and infrastructure partners (e.g., AWS, Akash, or blockchain nodes);",
              "Business Partners: third parties that integrate with AImpact (e.g., token launchpads, marketing platforms);",
              "Legal Authorities: if required to comply with applicable law or protect our legal rights;",
              "Affiliates: within our group of companies, consistent with this policy."
            ]
          },
          {
            "type": "paragraph",
            "value": "We do not sell personal data."
          }
        ]
      },
      {
        "heading": "5. Data Storage and Security",
        "content": [
          {
            "type": "paragraph",
            "value": "We implement reasonable technical and organizational measures to protect your information from loss, misuse, and unauthorized access. However, no system is completely secure. Blockchain data, by nature, is public and immutable — once published, it cannot be deleted or altered."
          }
        ]
      },
      {
        "heading": "6. Data Retention",
        "content": [
          {
            "type": "paragraph",
            "value": "We retain your information as long as necessary to provide the Service, comply with legal obligations, and resolve disputes. Upon termination or request, certain data (like blockchain transactions) may remain permanently stored on-chain."
          }
        ]
      },
      {
        "heading": "7. Your Rights",
        "content": [
          {
            "type": "paragraph",
            "value": "If you are located in the EEA, UK, or other regions with data protection laws, you may have the right to:"
          },
          {
            "type": "list",
            "value": [
              "Access and receive a copy of your personal data;",
              "Request correction or deletion of inaccurate or unlawful data;",
              "Object to processing or withdraw consent where applicable;",
              "Request data portability (where technically possible)."
            ]
          },
          {
            "type": "paragraph",
            "value": "To exercise these rights, contact us at support@aimpact.dev."
          }
        ]
      },
      {
        "heading": "8. International Data Transfers",
        "content": [
          {
            "type": "paragraph",
            "value": "Your data may be transferred and processed outside your country of residence. Where applicable, we rely on standard contractual clauses or other lawful mechanisms to ensure adequate data protection."
          }
        ]
      },
      {
        "heading": "9. Cookies and Tracking",
        "content": [
          {
            "type": "paragraph",
            "value": "We use cookies and similar technologies to improve functionality, analyze usage, and personalize your experience. You can control cookies through your browser settings, but disabling them may limit certain features."
          }
        ]
      },
      {
        "heading": "10. Third-Party Links",
        "content": [
          {
            "type": "paragraph",
            "value": "The Service may contain links or integrations with third-party websites or dApps. We are not responsible for their privacy practices, content, or security. Please review the privacy policies of those third parties."
          }
        ]
      },
      {
        "heading": "11. Children's Privacy",
        "content": [
          {
            "type": "paragraph",
            "value": "AImpact is not intended for individuals under 18. We do not knowingly collect personal data from minors. If you believe a minor has provided us with personal data, please contact us to remove it."
          }
        ]
      },
      {
        "heading": "12. Changes to This Policy",
        "content": [
          {
            "type": "paragraph",
            "value": "We may update this Privacy Policy from time to time. The \"Last updated\" date at the top indicates when the policy was last revised. Continued use of the Service after changes constitutes acceptance of the updated policy."
          }
        ]
      },
      {
        "heading": "13. Contact Us",
        "content": [
          {
            "type": "paragraph",
            "value": "For questions, privacy requests, or concerns, contact us at:"
          },
          {
            "type": "contact",
            "value": {
              "email": "support@aimpact.dev",
              "website": "https://aimpact.dev"
            }
          }
        ]
      }
    ]
  }